---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.HVACLoadBuildingType
source: html/109bd983-81ee-b212-ff06-d07909219018.htm
---
# HVACLoadBuildingType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.